backend/app/controllers/games_controller.rb

  def create
    @user = User.create # TODO: This should be replaced with logged in user
    @game = @user.hosted_games.build(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-08-14 15:59:11.350024"], ["updated_at", "2014-08-14 15:59:11.350024"]]
INSERT INTO "games" ("created_at", "host_id", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-08-14 15:59:11.362579"], ["host_id", 1], ["updated_at", "2014-08-14 15:59:11.362579"]]